# Dean Property Consulting 2024

# Preprocessing the Dataset

## Imports

In [21]:
import pandas as pd

from pandas.api.types import is_string_dtype
from pandas.api.types import is_numeric_dtype

import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import geopy

from samstools import nullish

In [2]:
# read in dataset
df=pd.read_csv('../data/230000 RE Transfers 2010-2023 PROGRESS SORTED 2.csv',low_memory=False)

In [3]:
# peek at a sample
df.sample(5)

,Unnamed: 0,DATE,NEIGBORHOOD,No.,STREET,ZIP,SALE / ASK,WEB,RENT ROLL,UNITS,...,TAX,BEDS,BATHS,WEEKS,TELEPHONE,CONTACT,AGENCY,ANNUAL $,30yr,ZONING
39884,NaN,09/14/2023,NaN,NaN,NaN,NaN,"$1,771,000.00","458 77th St, Brooklyn, 11209",NaN,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"$94,912.00",7.18%,"R5B, BR"
2721,NaN,09/13/2013,NaN,474,Waverly Ave,11238,"$760,000.00",NaN,NaN,1,...,NaN,NaN,NaN,12,PropertyShark,NaN,NaN,"$27,515.00",4.74%,NaN
35752,NaN,07/19/2022,NaN,NaN,NaN,NaN,"$1,925,000.00","3046 Bedford Ave, Brooklyn, 11210",NaN,1,...,NaN,NaN,NaN,NaN,PropertyShark,NaN,NaN,"$80,838.00",5.54%,R2
29880,NaN,04/27/2021,NaN,157,Sterling Pl,11225,"$875,000.00","157 Sterling St, Brooklyn 11225",NaN,2,...,NaN,NaN,NaN,NaN,PropertyShark,NaN,NaN,"$20,257.00",2.98%,R5
874,NaN,02/29/2012,Park Slope,395,Sixth Ave,11215,"$2,450,000.00",NaN,NaN,2,...,"3,571",NaN,NaN,12,NaN,NaN,Corcoran,"$83,655.00",4.26%,NaN

## Preprocessing

In [4]:
df.tail(10)

,Unnamed: 0,DATE,NEIGBORHOOD,No.,STREET,ZIP,SALE / ASK,WEB,RENT ROLL,UNITS,...,TAX,BEDS,BATHS,WEEKS,TELEPHONE,CONTACT,AGENCY,ANNUAL $,30yr,ZONING
40681,NaN,12/14/2023,NaN,NaN,NaN,NaN,"$690,000.00","1670 73rd St, Brooklyn, 11204",NaN,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"$35,871.00",6.95%,R5
40682,NaN,12/14/2023,NaN,NaN,NaN,NaN,"$850,000.00","7415 Tenth Ave #1C, Brooklyn, 11228",NaN,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"$44,189.00",6.95%,R5B
40683,NaN,12/14/2023,NaN,NaN,NaN,NaN,"$1,120,000.00","168 Bleecker St, Brooklyn, 11221",NaN,6,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"$58,225.00",6.95%,R6
40684,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,$0.00,NaN,NaN
40685,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,$0.00,NaN,NaN
40686,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,$0.00,NaN,NaN
40687,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,$0.00,NaN,NaN
40688,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,$0.00,NaN,NaN
40689,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,$0.00,NaN,NaN
40690,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,$0.00,NaN,NaN

In [5]:
# remove the bottom 7 rows as they're blank data
df=df[:-7]
df.tail()

,Unnamed: 0,DATE,NEIGBORHOOD,No.,STREET,ZIP,SALE / ASK,WEB,RENT ROLL,UNITS,...,TAX,BEDS,BATHS,WEEKS,TELEPHONE,CONTACT,AGENCY,ANNUAL $,30yr,ZONING
40679,NaN,12/14/2023,NaN,NaN,NaN,NaN,"$470,000.00","752 Rutland Rd, Brooklyn, 11203",NaN,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"$24,434.00",6.95%,R6
40680,NaN,12/14/2023,NaN,NaN,NaN,NaN,"$2,220,000.00","722 Chauncey St, Brooklyn, 11207",NaN,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"$115,411.00",6.95%,R6
40681,NaN,12/14/2023,NaN,NaN,NaN,NaN,"$690,000.00","1670 73rd St, Brooklyn, 11204",NaN,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"$35,871.00",6.95%,R5
40682,NaN,12/14/2023,NaN,NaN,NaN,NaN,"$850,000.00","7415 Tenth Ave #1C, Brooklyn, 11228",NaN,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"$44,189.00",6.95%,R5B
40683,NaN,12/14/2023,NaN,NaN,NaN,NaN,"$1,120,000.00","168 Bleecker St, Brooklyn, 11221",NaN,6,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"$58,225.00",6.95%,R6

In [6]:
# check information about dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40684 entries, 0 to 40683
Data columns (total 31 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   187 non-null    object
 1   DATE         40684 non-null  object
 2   NEIGBORHOOD  1753 non-null   object
 3   No.          33735 non-null  object
 4   STREET       33735 non-null  object
 5   ZIP          33405 non-null  object
 6   SALE / ASK   40682 non-null  object
 7   WEB          17352 non-null  object
 8   RENT ROLL    7548 non-null   object
 9   UNITS        40656 non-null  object
 10  FLOORS       40675 non-null  object
 11  LEGAL        39920 non-null  object
 12  STRUCTURE    20986 non-null  object
 13  C            927 non-null    object
 14  LOT 1        28936 non-null  object
 15  LOT 2        34403 non-null  object
 16  SF           40670 non-null  object
 17  $/SF         39776 non-null  object
 18  SF/FLOOR     39619 non-null  object
 19  $/FLOOR      40119 non-null  object
 20  CHARGES      171 non-null    object
 21  TAX          957 non-null    object
 22  BEDS         819 non-null    object
 23  BATHS        828 non-null    float64
 24  WEEKS        10753 non-null  object
 25  TELEPHONE    37110 non-null  object
 26  CONTACT      198 non-null    object
 27  AGENCY       529 non-null    object
 28  ANNUAL $     40602 non-null  object
 29  30yr         40359 non-null  object
 30  ZONING       32547 non-null  object
dtypes: float64(1), object(30)
memory usage: 9.6+ MB

Convert some columns to appropriate data types.

In [7]:
# convert date column to correct format
df['DATE']=pd.to_datetime(df['DATE'])

# SALE / ASK column
# remove dollar symbol 
# convert to number data type
df['SALE / ASK']=df['SALE / ASK'].str.replace(r'[\$,]', '', regex=True)
df['SALE / ASK']=df['SALE / ASK'].astype('float64')

# recheck
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40684 entries, 0 to 40683
Data columns (total 31 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   187 non-null    object
 1   DATE         40684 non-null  datetime64[ns]
 2   NEIGBORHOOD  1753 non-null   object
 3   No.          33735 non-null  object
 4   STREET       33735 non-null  object
 5   ZIP          33405 non-null  object
 6   SALE / ASK   40682 non-null  float64
 7   WEB          17352 non-null  object
 8   RENT ROLL    7548 non-null   object
 9   UNITS        40656 non-null  object
 10  FLOORS       40675 non-null  object
 11  LEGAL        39920 non-null  object
 12  STRUCTURE    20986 non-null  object
 13  C            927 non-null    object
 14  LOT 1        28936 non-null  object
 15  LOT 2        34403 non-null  object
 16  SF           40670 non-null  object
 17  $/SF         39776 non-null  object
 18  SF/FLOOR     39619 non-null  object
 19  $/FLOOR      40119 non-null  object
 20  CHARGES      171 non-null    object
 21  TAX          957 non-null    object
 22  BEDS         819 non-null    object
 23  BATHS        828 non-null    float64
 24  WEEKS        10753 non-null  object
 25  TELEPHONE    37110 non-null  object
 26  CONTACT      198 non-null    object
 27  AGENCY       529 non-null    object
 28  ANNUAL $     40602 non-null  object
 29  30yr         40359 non-null  object
 30  ZONING       32547 non-null  object
dtypes: datetime64[ns](1), float64(2), object(28)
memory usage: 9.6+ MB

In [17]:
# troubleshooting to make sure my custom function(s)
# are located at one of these paths
import sys
print(sys.path)

['/Users/sra/files/projects/real_estate_in_brooklyn/dean_property_consulting_2024', '/Applications/Anaconda/anaconda3/envs/gis/lib/python310.zip', '/Applications/Anaconda/anaconda3/envs/gis/lib/python3.10', '/Applications/Anaconda/anaconda3/envs/gis/lib/python3.10/lib-dynload', '', '/Applications/Anaconda/anaconda3/envs/gis/lib/python3.10/site-packages']

In [26]:
# my first custom function!
import samstools as st
st.nullish(df)

TypeError: 'module' object is not callable

In [9]:
# create reduced column list 
low_null_columns=[col for col in df.columns if df[col].isnull().sum()<100]
low_null_columns

['DATE', 'SALE / ASK', 'UNITS', 'FLOORS', 'SF', 'ANNUAL $']

In [10]:
# make new dataset with low-null columns
df_lownull=df[low_null_columns].copy()
df_lownull

            DATE  SALE / ASK UNITS FLOORS     SF     ANNUAL $
0     2010-01-03    770000.0     1    2.5  2,722   $36,033.00
1     2010-01-06   1397478.0     2      3  3,780   $63,202.00
2     2010-01-10    505000.0     1      1    800   $30,089.00
3     2010-01-11    450000.0     1      1    650   $31,473.00
4     2010-01-11   1530000.0     3      3  3,200   $69,400.00
...          ...         ...   ...    ...    ...          ...
40679 2023-12-14    470000.0     2      2  1,966   $24,434.00
40680 2023-12-14   2220000.0     1      2  1,872  $115,411.00
40681 2023-12-14    690000.0     1      2    986   $35,871.00
40682 2023-12-14    850000.0     1      3  1,660   $44,189.00
40683 2023-12-14   1120000.0     6      3  4,875   $58,225.00

[40684 rows x 6 columns]

In [11]:
# ANNUAL $ column
# remove dollar symbol 
# convert to number data type
df_lownull['ANNUAL $']=df_lownull['ANNUAL $'].str.replace(r'[\$,]', '', regex=True).astype('float64')

# check
print(df_lownull['ANNUAL $'].sample(3))

2831     42569.0
27837    16779.0
9452     68565.0
Name: ANNUAL $, dtype: float64

In [12]:
df_lownull['SF'].value_counts()

SF
0          892
2,400      566
2,700      493
3,000      489
3,600      427
          ...
$908.00      1
5,046        1
6,883        1
1,513        1
38,792       1
Name: count, Length: 5229, dtype: int64

In [13]:
# SF column
# remove comma symbol 
# convert to number data type
df_lownull['SF']=df_lownull['SF'].str.replace(",|\s|[^a-z]",'').astype('float64')

# check
print(df_lownull['SF'].sample(3))

ValueError: could not convert string to float: '2,722'

In [14]:
df_lownull.isnull().sum()

DATE           0
SALE / ASK     2
UNITS         28
FLOORS         9
SF            14
ANNUAL $      82
dtype: int64

In [16]:
for col in df_lownull.columns:
    print(f'The percentage of nulls for column {col} is:')
    print(f'{(df_lownull[col].isnull().sum())/(df_lownull.shape[0])*100}\n')

The percentage of nulls for column DATE is:
0.0

The percentage of nulls for column SALE / ASK is:
0.004915937469275391

The percentage of nulls for column UNITS is:
0.06882312456985547

The percentage of nulls for column FLOORS is:
0.02212171861173926

The percentage of nulls for column SF is:
0.034411562284927734

The percentage of nulls for column ANNUAL $ is:
0.20155343624029104

We will drop the null values in this subset dataframe as there are very few null rows relative to the entire dataframe.

In [17]:
df_lownull=df_lownull.dropna()
df_lownull.head()

        DATE  SALE / ASK UNITS FLOORS     SF  ANNUAL $
0 2010-01-03    770000.0     1    2.5  2,722   36033.0
1 2010-01-06   1397478.0     2      3  3,780   63202.0
2 2010-01-10    505000.0     1      1    800   30089.0
3 2010-01-11    450000.0     1      1    650   31473.0
4 2010-01-11   1530000.0     3      3  3,200   69400.0